In [2]:
import numpy as np
import pandas as pd

DATAFRAME USING LIST

In [3]:
student=[
    [1,"Rohit","male",12],
    [2,"Sita","Female",11],
    [3,"Babu","male",12],
    [4,"Tulasi","male",13],
    [5,"Mukhi","Female",11]
]
pd.DataFrame(student,columns=["Rollno",'Name','Gender',"Age"])

   Rollno    Name  Gender  Age
0       1   Rohit    male   12
1       2    Sita  Female   11
2       3    Babu    male   12
3       4  Tulasi    male   13
4       5   Mukhi  Female   11

DATAFRAME USING DICTONARIES

In [4]:
student= {
    'Rollno':[1,2,3,4,5],
    'name': ['Rohit','Sita','Ravi','Tulasi','Mukhi'],
    'gender':['male','female','male','male','female'],
    'Age':[12,11,13,11,12]
}
df=pd.DataFrame(student)
df

   Rollno    name  gender  Age
0       1   Rohit    male   12
1       2    Sita  female   11
2       3    Ravi    male   13
3       4  Tulasi    male   11
4       5   Mukhi  female   12

RENAME

In [5]:
df.rename(columns={"Rollno": "ID", "Age": "Class"}, inplace=True)
df

   ID    name  gender  Class
0   1   Rohit    male     12
1   2    Sita  female     11
2   3    Ravi    male     13
3   4  Tulasi    male     11
4   5   Mukhi  female     12

DROP COLOUMNS

In [6]:
df.drop(columns='gender',inplace=True)
df

   ID    name  Class
0   1   Rohit     12
1   2    Sita     11
2   3    Ravi     13
3   4  Tulasi     11
4   5   Mukhi     12

ADD NEWCOLOUM

In [7]:
df['Grade']=['A','A+','O','B+','A']
df

   ID    name  Class Grade
0   1   Rohit     12     A
1   2    Sita     11    A+
2   3    Ravi     13     O
3   4  Tulasi     11    B+
4   5   Mukhi     12     A

In [8]:
df['new']=df['Class']+df['ID']
df

   ID    name  Class Grade  new
0   1   Rohit     12     A   13
1   2    Sita     11    A+   13
2   3    Ravi     13     O   16
3   4  Tulasi     11    B+   15
4   5   Mukhi     12     A   17

GROUPBY FUNCTION

In [9]:
import pandas as pd

data = {
    'Category': ['A', 'B', 'A', 'B', 'C', 'A'],
    'Values': [10, 20, 15, 25, 35, 40]
}

df = pd.DataFrame(data)

# Group by 'Category' and calculate the sum of 'Values'
grouped = df.groupby('Category')['Values'].sum()
print(grouped)

Category
A    65
B    45
C    35
Name: Values, dtype: int64

In [17]:
import pandas as pd

# Data
data = {
    'Name': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie'],
    'Subject': ['Math', 'Math', 'Science', 'Science', 'Math'],
    'Score': [85, 90, 95, 80, 70]
}

# Create DataFrame
df = pd.DataFrame(data)

# Group by 'Subject' and calculate multiple stats
stats = df.groupby('Subject')['Score'].agg(['sum', 'mean'])
print(stats)

         sum       mean
Subject
Math     245  81.666667
Science  175  87.500000

In [19]:
import pandas as pd

# Data
data = {
    'Name': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie'],
    'Subject': ['Math', 'Math', 'Science', 'Science', 'Math'],
    'Score': [85, 90, 95, 80, 70]
}

# Create DataFrame
df = pd.DataFrame(data)
s=df.groupby('Name')
print(s)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000201A805E060>

In [20]:
#This output tells you that s is a DataFrameGroupBy object, which is ready for further operations but doesn't display the actual grouped data